mapkeeper/ycsb/data/thrift2/hsha_7000
YCSB Client 0.1
Command line: -db com.yahoo.ycsb.db.MapKeeperClient -P workloads/workloada -p mapkeeper.host=dqa-config2-006.dht.bf1.yahoo.com -p mapkeeper.port=9090 -s -threads 7000 -load
Loading workload...
Starting test.
SLF4J: Failed to load class "org.slf4j.impl.StaticLoggerBinder".
SLF4J: Defaulting to no-operation (NOP) logger implementation
SLF4J: See http://www.slf4j.org/codes.html#StaticLoggerBinder for further details.
 0 sec: 0 operations; 
Maximum execution time specified as: 60 secs
 10 sec: 601645 operations; 59781.9 current ops/sec; [INSERT AverageLatency(us)=23421.84] 
 20 sec: 1183859 operations; 58163.24 current ops/sec; [INSERT AverageLatency(us)=40148.22] 
 30 sec: 1697550 operations; 51343.43 current ops/sec; [INSERT AverageLatency(us)=50952.52] 
 40 sec: 2204678 operations; 50687.46 current ops/sec; [INSERT AverageLatency(us)=53618.73] 
 50 sec: 2734361 operations; 52947.12 current ops/sec; [INSERT AverageLatency(us)=52433.98] 
 60 sec: 3284488 operations; 54985.21 current ops/sec; [INSERT AverageLatency(us)=55438.65] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
Still waiting for thread Thread-1084 to complete. Workload status: true
Still waiting for thread Thread-1084 to complete. Workload status: true
 70 sec: 3513310 operations; 22868.48 current ops/sec; [INSERT AverageLatency(us)=54695.66] 
Still waiting for thread Thread-1084 to complete. Workload status: true
Still waiting for thread Thread-1084 to complete. Workload status: true
Still waiting for thread Thread-1084 to complete. Workload status: true
[...]
 80 sec: 3513310 operations; 0 current ops/sec;  
Still waiting for thread Thread-1084 to complete. Workload status: true
Still waiting for thread Thread-1084 to complete. Workload status: true
Still waiting for thread Thread-1084 to complete. Workload status: true
[...]
 90 sec: 3513310 operations; 0 current ops/sec;  
Still waiting for thread Thread-1084 to complete. Workload status: true
Still waiting for thread Thread-1084 to complete. Workload status: true
 97 sec: 3513310 operations; 0 current ops/sec;  
[OVERALL], RunTime(ms), 97200.0
[OVERALL], Throughput(ops/sec), 36145.1646090535
[INSERT], Operations, 3513310
[INSERT], AverageLatency(us), 45999.32970162041
[INSERT], MinLatency(us), 260
[INSERT], MaxLatency(us), 14956681
[INSERT], 95thPercentileLatency(ms), 56
[INSERT], 99thPercentileLatency(ms), 59
[INSERT], Return=0, 3513310
[INSERT], 0, 1586
[INSERT], 1, 3219
[INSERT], 2, 2509
[INSERT], 3, 1854
[INSERT], 4, 1621
[INSERT], 5, 1147
[INSERT], 6, 910
[INSERT], 7, 1262
[INSERT], 8, 1269
[INSERT], 9, 1726
[INSERT], 10, 2124
[INSERT], 11, 2754
[INSERT], 12, 12650
[INSERT], 13, 29269
[INSERT], 14, 12953
[INSERT], 15, 14803
[INSERT], 16, 14237
[INSERT], 17, 23523
[INSERT], 18, 35394
[INSERT], 19, 35235
[INSERT], 20, 26493
[INSERT], 21, 33605
[INSERT], 22, 30949
[INSERT], 23, 44475
[INSERT], 24, 57213
[INSERT], 25, 80567
[INSERT], 26, 52729
[INSERT], 27, 66472
[INSERT], 28, 43305
[INSERT], 29, 18164
[INSERT], 30, 12669
[INSERT], 31, 26533
[INSERT], 32, 31266
[INSERT], 33, 34288
[INSERT], 34, 33486
[INSERT], 35, 40751
[INSERT], 36, 34148
[INSERT], 37, 35773
[INSERT], 38, 41585
[INSERT], 39, 52427
[INSERT], 40, 129546
[INSERT], 41, 84803
[INSERT], 42, 42310
[INSERT], 43, 29910
[INSERT], 44, 9318
[INSERT], 45, 4672
[INSERT], 46, 9289
[INSERT], 47, 25598
[INSERT], 48, 55631
[INSERT], 49, 98907
[INSERT], 50, 190549
[INSERT], 51, 270644
[INSERT], 52, 414803
[INSERT], 53, 430621
[INSERT], 54, 263744
[INSERT], 55, 198664
[INSERT], 56, 118459
[INSERT], 57, 60519
[INSERT], 58, 38203
[INSERT], 59, 15670
[INSERT], 60, 7059
[INSERT], 61, 1548
[INSERT], 62, 1857
[INSERT], 63, 1458
[INSERT], 64, 1162
[INSERT], 65, 528
[INSERT], 66, 791
[INSERT], 67, 141
[INSERT], 68, 156
[INSERT], 69, 103
[INSERT], 70, 151
[INSERT], 71, 119
[INSERT], 72, 207
[INSERT], 73, 212
[INSERT], 74, 340
[INSERT], 75, 406
[INSERT], 76, 291
[INSERT], 77, 491
[INSERT], 78, 494
[INSERT], 79, 508
[INSERT], 80, 490
[INSERT], 81, 565
[INSERT], 82, 546
[INSERT], 83, 328
[INSERT], 84, 171
[INSERT], 85, 145
[INSERT], 86, 132
[INSERT], 87, 87
[INSERT], 88, 81
[INSERT], 89, 74
[INSERT], 90, 106
[INSERT], 91, 108
[INSERT], 92, 111
[INSERT], 93, 56
[INSERT], 94, 62
[INSERT], 95, 46
[INSERT], 96, 44
[INSERT], 97, 38
[INSERT], 98, 9
[INSERT], 99, 8
[INSERT], 100, 48
[INSERT], 101, 59
[INSERT], 102, 46
[INSERT], 103, 33
[INSERT], 104, 67
[INSERT], 105, 30
[INSERT], 106, 9
[INSERT], 107, 7
[INSERT], 108, 15
[INSERT], 109, 7
[INSERT], 110, 6
[INSERT], 111, 20
[INSERT], 112, 89
[INSERT], 113, 90
[INSERT], 114, 84
[INSERT], 115, 62
[INSERT], 116, 50
[INSERT], 117, 50
[INSERT], 118, 85
[INSERT], 119, 100
[INSERT], 120, 81
[INSERT], 121, 90
[INSERT], 122, 47
[INSERT], 123, 3
[INSERT], 124, 2
[INSERT], 125, 2
[INSERT], 126, 0
[INSERT], 127, 0
[INSERT], 128, 2
[INSERT], 129, 2
[INSERT], 130, 0
[INSERT], 131, 2
[INSERT], 132, 2
[INSERT], 133, 0
[INSERT], 134, 1
[INSERT], 135, 1
[INSERT], 136, 0
[INSERT], 137, 3
[INSERT], 138, 0
[INSERT], 139, 0
[INSERT], 140, 1
[INSERT], 141, 1
[INSERT], 142, 0
[INSERT], 143, 0
[INSERT], 144, 1
[INSERT], 145, 0
[INSERT], 146, 0
[INSERT], 147, 4
[INSERT], 148, 0
[INSERT], 149, 2
[INSERT], 150, 0
[INSERT], 151, 0
[INSERT], 152, 0
[INSERT], 153, 1
[INSERT], 154, 1
[INSERT], 155, 0
[INSERT], 156, 0
[INSERT], 157, 1
[INSERT], 158, 0
[INSERT], 159, 0
[INSERT], 160, 3
[INSERT], 161, 0
[INSERT], 162, 1
[INSERT], 163, 1
[INSERT], 164, 0
[INSERT], 165, 2
[INSERT], 166, 0
[INSERT], 167, 1
[INSERT], 168, 2
[INSERT], 169, 1
[INSERT], 170, 1
[INSERT], 171, 0
[INSERT], 172, 0
[INSERT], 173, 0
[INSERT], 174, 2
[INSERT], 175, 0
[INSERT], 176, 0
[INSERT], 177, 1
[INSERT], 178, 1
[INSERT], 179, 2
[INSERT], 180, 0
[INSERT], 181, 0
[INSERT], 182, 0
[INSERT], 183, 0
[INSERT], 184, 2
[INSERT], 185, 0
[INSERT], 186, 3
[INSERT], 187, 0
[INSERT], 188, 0
[INSERT], 189, 0
[INSERT], 190, 0
[INSERT], 191, 2
[INSERT], 192, 2
[INSERT], 193, 0
[INSERT], 194, 0
[INSERT], 195, 0
[INSERT], 196, 0
[INSERT], 197, 6
[INSERT], 198, 1
[INSERT], 199, 2
[INSERT], 200, 1
[INSERT], 201, 1
[INSERT], 202, 1
[INSERT], 203, 2
[INSERT], 204, 1
[INSERT], 205, 2
[INSERT], 206, 1
[INSERT], 207, 1
[INSERT], 208, 2
[INSERT], 209, 2
[INSERT], 210, 1
[INSERT], 211, 2
[INSERT], 212, 1
[INSERT], 213, 1
[INSERT], 214, 1
[INSERT], 215, 1
[INSERT], 216, 1
[INSERT], 217, 0
[INSERT], 218, 1
[INSERT], 219, 2
[INSERT], 220, 2
[INSERT], 221, 0
[INSERT], 222, 0
[INSERT], 223, 2
[INSERT], 224, 0
[INSERT], 225, 0
[INSERT], 226, 1
[INSERT], 227, 1
[INSERT], 228, 1
[INSERT], 229, 1
[INSERT], 230, 2
[INSERT], 231, 0
[INSERT], 232, 0
[INSERT], 233, 1
[INSERT], 234, 1
[INSERT], 235, 2
[INSERT], 236, 1
[INSERT], 237, 0
[INSERT], 238, 1
[INSERT], 239, 0
[INSERT], 240, 0
[INSERT], 241, 2
[INSERT], 242, 1
[INSERT], 243, 1
[INSERT], 244, 0
[INSERT], 245, 1
[INSERT], 246, 1
[INSERT], 247, 1
[INSERT], 248, 2
[INSERT], 249, 1
[INSERT], 250, 1
[INSERT], 251, 0
[INSERT], 252, 2
[INSERT], 253, 1
[INSERT], 254, 2
[INSERT], 255, 3
[INSERT], 256, 0
[INSERT], 257, 2
[INSERT], 258, 0
[INSERT], 259, 1
[INSERT], 260, 2
[INSERT], 261, 0
[INSERT], 262, 0
[INSERT], 263, 0
[INSERT], 264, 1
[INSERT], 265, 0
[INSERT], 266, 0
[INSERT], 267, 0
[INSERT], 268, 1
[INSERT], 269, 0
[INSERT], 270, 1
[INSERT], 271, 3
[INSERT], 272, 0
[INSERT], 273, 0
[INSERT], 274, 2
[INSERT], 275, 1
[INSERT], 276, 3
[INSERT], 277, 3
[INSERT], 278, 0
[INSERT], 279, 0
[INSERT], 280, 1
[INSERT], 281, 0
[INSERT], 282, 0
[INSERT], 283, 2
[INSERT], 284, 2
[INSERT], 285, 2
[INSERT], 286, 0
[INSERT], 287, 0
[INSERT], 288, 0
[INSERT], 289, 0
[INSERT], 290, 1
[INSERT], 291, 1
[INSERT], 292, 0
[INSERT], 293, 0
[INSERT], 294, 2
[INSERT], 295, 0
[INSERT], 296, 1
[INSERT], 297, 1
[INSERT], 298, 2
[INSERT], 299, 1
[INSERT], 300, 1
[INSERT], 301, 2
[INSERT], 302, 0
[INSERT], 303, 0
[INSERT], 304, 2
[INSERT], 305, 1
[INSERT], 306, 2
[INSERT], 307, 1
[INSERT], 308, 0
[INSERT], 309, 0
[INSERT], 310, 0
[INSERT], 311, 0
[INSERT], 312, 3
[INSERT], 313, 2
[INSERT], 314, 1
[INSERT], 315, 0
[INSERT], 316, 1
[INSERT], 317, 0
[INSERT], 318, 1
[INSERT], 319, 2
[INSERT], 320, 0
[INSERT], 321, 3
[INSERT], 322, 0
[INSERT], 323, 0
[INSERT], 324, 3
[INSERT], 325, 1
[INSERT], 326, 2
[INSERT], 327, 1
[INSERT], 328, 0
[INSERT], 329, 0
[INSERT], 330, 0
[INSERT], 331, 0
[INSERT], 332, 1
[INSERT], 333, 1
[INSERT], 334, 1
[INSERT], 335, 1
[INSERT], 336, 2
[INSERT], 337, 1
[INSERT], 338, 0
[INSERT], 339, 2
[INSERT], 340, 0
[INSERT], 341, 1
[INSERT], 342, 1
[INSERT], 343, 1
[INSERT], 344, 0
[INSERT], 345, 0
[INSERT], 346, 0
[INSERT], 347, 0
[INSERT], 348, 3
[INSERT], 349, 1
[INSERT], 350, 1
[INSERT], 351, 0
[INSERT], 352, 1
[INSERT], 353, 1
[INSERT], 354, 3
[INSERT], 355, 2
[INSERT], 356, 0
[INSERT], 357, 0
[INSERT], 358, 0
[INSERT], 359, 1
[INSERT], 360, 1
[INSERT], 361, 3
[INSERT], 362, 3
[INSERT], 363, 4
[INSERT], 364, 9
[INSERT], 365, 11
[INSERT], 366, 13
[INSERT], 367, 10
[INSERT], 368, 9
[INSERT], 369, 8
[INSERT], 370, 10
[INSERT], 371, 6
[INSERT], 372, 5
[INSERT], 373, 5
[INSERT], 374, 2
[INSERT], 375, 4
[INSERT], 376, 4
[INSERT], 377, 2
[INSERT], 378, 8
[INSERT], 379, 0
[INSERT], 380, 3
[INSERT], 381, 3
[INSERT], 382, 1
[INSERT], 383, 0
[INSERT], 384, 0
[INSERT], 385, 2
[INSERT], 386, 0
[INSERT], 387, 0
[INSERT], 388, 1
[INSERT], 389, 1
[INSERT], 390, 1
[INSERT], 391, 0
[INSERT], 392, 0
[INSERT], 393, 2
[INSERT], 394, 0
[INSERT], 395, 1
[INSERT], 396, 1
[INSERT], 397, 0
[INSERT], 398, 1
[INSERT], 399, 0
[INSERT], 400, 0
[INSERT], 401, 1
[INSERT], 402, 3
[INSERT], 403, 0
[INSERT], 404, 0
[INSERT], 405, 1
[INSERT], 406, 0
[INSERT], 407, 0
[INSERT], 408, 1
[INSERT], 409, 0
[INSERT], 410, 2
[INSERT], 411, 0
[INSERT], 412, 0
[INSERT], 413, 1
[INSERT], 414, 1
[INSERT], 415, 0
[INSERT], 416, 0
[INSERT], 417, 0
[INSERT], 418, 1
[INSERT], 419, 1
[INSERT], 420, 1
[INSERT], 421, 1
[INSERT], 422, 0
[INSERT], 423, 1
[INSERT], 424, 0
[INSERT], 425, 2
[INSERT], 426, 1
[INSERT], 427, 0
[INSERT], 428, 1
[INSERT], 429, 0
[INSERT], 430, 1
[INSERT], 431, 0
[INSERT], 432, 0
[INSERT], 433, 1
[INSERT], 434, 0
[INSERT], 435, 0
[INSERT], 436, 1
[INSERT], 437, 1
[INSERT], 438, 0
[INSERT], 439, 2
[INSERT], 440, 3
[INSERT], 441, 0
[INSERT], 442, 0
[INSERT], 443, 1
[INSERT], 444, 0
[INSERT], 445, 0
[INSERT], 446, 0
[INSERT], 447, 1
[INSERT], 448, 1
[INSERT], 449, 0
[INSERT], 450, 1
[INSERT], 451, 1
[INSERT], 452, 0
[INSERT], 453, 0
[INSERT], 454, 2
[INSERT], 455, 0
[INSERT], 456, 0
[INSERT], 457, 0
[INSERT], 458, 0
[INSERT], 459, 1
[INSERT], 460, 1
[INSERT], 461, 0
[INSERT], 462, 4
[INSERT], 463, 5
[INSERT], 464, 4
[INSERT], 465, 4
[INSERT], 466, 2
[INSERT], 467, 3
[INSERT], 468, 5
[INSERT], 469, 3
[INSERT], 470, 2
[INSERT], 471, 4
[INSERT], 472, 3
[INSERT], 473, 3
[INSERT], 474, 3
[INSERT], 475, 1
[INSERT], 476, 1
[INSERT], 477, 5
[INSERT], 478, 5
[INSERT], 479, 8
[INSERT], 480, 2
[INSERT], 481, 7
[INSERT], 482, 4
[INSERT], 483, 4
[INSERT], 484, 2
[INSERT], 485, 8
[INSERT], 486, 1
[INSERT], 487, 10
[INSERT], 488, 4
[INSERT], 489, 2
[INSERT], 490, 1
[INSERT], 491, 4
[INSERT], 492, 4
[INSERT], 493, 0
[INSERT], 494, 0
[INSERT], 495, 1
[INSERT], 496, 5
[INSERT], 497, 3
[INSERT], 498, 1
[INSERT], 499, 0
[INSERT], 500, 1
[INSERT], 501, 0
[INSERT], 502, 2
[INSERT], 503, 0
[INSERT], 504, 1
[INSERT], 505, 2
[INSERT], 506, 1
[INSERT], 507, 2
[INSERT], 508, 3
[INSERT], 509, 7
[INSERT], 510, 6
[INSERT], 511, 12
[INSERT], 512, 4
[INSERT], 513, 1
[INSERT], 514, 1
[INSERT], 515, 3
[INSERT], 516, 1
[INSERT], 517, 1
[INSERT], 518, 3
[INSERT], 519, 2
[INSERT], 520, 2
[INSERT], 521, 5
[INSERT], 522, 1
[INSERT], 523, 3
[INSERT], 524, 5
[INSERT], 525, 7
[INSERT], 526, 0
[INSERT], 527, 5
[INSERT], 528, 1
[INSERT], 529, 1
[INSERT], 530, 3
[INSERT], 531, 4
[INSERT], 532, 1
[INSERT], 533, 2
[INSERT], 534, 1
[INSERT], 535, 1
[INSERT], 536, 1
[INSERT], 537, 4
[INSERT], 538, 0
[INSERT], 539, 2
[INSERT], 540, 0
[INSERT], 541, 1
[INSERT], 542, 0
[INSERT], 543, 3
[INSERT], 544, 5
[INSERT], 545, 2
[INSERT], 546, 0
[INSERT], 547, 3
[INSERT], 548, 2
[INSERT], 549, 5
[INSERT], 550, 1
[INSERT], 551, 2
[INSERT], 552, 2
[INSERT], 553, 2
[INSERT], 554, 1
[INSERT], 555, 3
[INSERT], 556, 2
[INSERT], 557, 2
[INSERT], 558, 3
[INSERT], 559, 1
[INSERT], 560, 1
[INSERT], 561, 5
[INSERT], 562, 3
[INSERT], 563, 0
[INSERT], 564, 1
[INSERT], 565, 6
[INSERT], 566, 8
[INSERT], 567, 0
[INSERT], 568, 1
[INSERT], 569, 0
[INSERT], 570, 2
[INSERT], 571, 3
[INSERT], 572, 5
[INSERT], 573, 1
[INSERT], 574, 2
[INSERT], 575, 3
[INSERT], 576, 3
[INSERT], 577, 0
[INSERT], 578, 3
[INSERT], 579, 1
[INSERT], 580, 2
[INSERT], 581, 3
[INSERT], 582, 1
[INSERT], 583, 2
[INSERT], 584, 4
[INSERT], 585, 1
[INSERT], 586, 2
[INSERT], 587, 5
[INSERT], 588, 1
[INSERT], 589, 1
[INSERT], 590, 2
[INSERT], 591, 2
[INSERT], 592, 3
[INSERT], 593, 3
[INSERT], 594, 4
[INSERT], 595, 2
[INSERT], 596, 1
[INSERT], 597, 6
[INSERT], 598, 1
[INSERT], 599, 4
[INSERT], 600, 3
[INSERT], 601, 2
[INSERT], 602, 1
[INSERT], 603, 1
[INSERT], 604, 2
[INSERT], 605, 3
[INSERT], 606, 2
[INSERT], 607, 1
[INSERT], 608, 0
[INSERT], 609, 3
[INSERT], 610, 1
[INSERT], 611, 1
[INSERT], 612, 3
[INSERT], 613, 2
[INSERT], 614, 1
[INSERT], 615, 3
[INSERT], 616, 8
[INSERT], 617, 3
[INSERT], 618, 2
[INSERT], 619, 4
[INSERT], 620, 2
[INSERT], 621, 2
[INSERT], 622, 5
[INSERT], 623, 2
[INSERT], 624, 3
[INSERT], 625, 1
[INSERT], 626, 0
[INSERT], 627, 2
[INSERT], 628, 2
[INSERT], 629, 4
[INSERT], 630, 3
[INSERT], 631, 6
[INSERT], 632, 2
[INSERT], 633, 2
[INSERT], 634, 1
[INSERT], 635, 2
[INSERT], 636, 3
[INSERT], 637, 0
[INSERT], 638, 1
[INSERT], 639, 3
[INSERT], 640, 1
[INSERT], 641, 1
[INSERT], 642, 0
[INSERT], 643, 1
[INSERT], 644, 0
[INSERT], 645, 3
[INSERT], 646, 2
[INSERT], 647, 0
[INSERT], 648, 4
[INSERT], 649, 6
[INSERT], 650, 4
[INSERT], 651, 2
[INSERT], 652, 4
[INSERT], 653, 2
[INSERT], 654, 7
[INSERT], 655, 2
[INSERT], 656, 2
[INSERT], 657, 5
[INSERT], 658, 6
[INSERT], 659, 5
[INSERT], 660, 2
[INSERT], 661, 1
[INSERT], 662, 1
[INSERT], 663, 0
[INSERT], 664, 1
[INSERT], 665, 0
[INSERT], 666, 2
[INSERT], 667, 0
[INSERT], 668, 1
[INSERT], 669, 1
[INSERT], 670, 0
[INSERT], 671, 2
[INSERT], 672, 0
[INSERT], 673, 1
[INSERT], 674, 1
[INSERT], 675, 1
[INSERT], 676, 2
[INSERT], 677, 0
[INSERT], 678, 1
[INSERT], 679, 1
[INSERT], 680, 3
[INSERT], 681, 1
[INSERT], 682, 2
[INSERT], 683, 1
[INSERT], 684, 1
[INSERT], 685, 2
[INSERT], 686, 0
[INSERT], 687, 0
[INSERT], 688, 0
[INSERT], 689, 0
[INSERT], 690, 0
[INSERT], 691, 0
[INSERT], 692, 0
[INSERT], 693, 0
[INSERT], 694, 0
[INSERT], 695, 3
[INSERT], 696, 0
[INSERT], 697, 0
[INSERT], 698, 0
[INSERT], 699, 1
[INSERT], 700, 0
[INSERT], 701, 1
[INSERT], 702, 0
[INSERT], 703, 0
[INSERT], 704, 0
[INSERT], 705, 0
[INSERT], 706, 0
[INSERT], 707, 0
[INSERT], 708, 0
[INSERT], 709, 0
[INSERT], 710, 1
[INSERT], 711, 0
[INSERT], 712, 0
[INSERT], 713, 1
[INSERT], 714, 0
[INSERT], 715, 0
[INSERT], 716, 2
[INSERT], 717, 0
[INSERT], 718, 0
[INSERT], 719, 0
[INSERT], 720, 0
[INSERT], 721, 0
[INSERT], 722, 2
[INSERT], 723, 0
[INSERT], 724, 1
[INSERT], 725, 0
[INSERT], 726, 0
[INSERT], 727, 1
[INSERT], 728, 0
[INSERT], 729, 0
[INSERT], 730, 0
[INSERT], 731, 1
[INSERT], 732, 1
[INSERT], 733, 1
[INSERT], 734, 0
[INSERT], 735, 0
[INSERT], 736, 0
[INSERT], 737, 1
[INSERT], 738, 2
[INSERT], 739, 1
[INSERT], 740, 2
[INSERT], 741, 2
[INSERT], 742, 2
[INSERT], 743, 3
[INSERT], 744, 2
[INSERT], 745, 1
[INSERT], 746, 3
[INSERT], 747, 1
[INSERT], 748, 0
[INSERT], 749, 3
[INSERT], 750, 2
[INSERT], 751, 1
[INSERT], 752, 2
[INSERT], 753, 3
[INSERT], 754, 2
[INSERT], 755, 1
[INSERT], 756, 1
[INSERT], 757, 4
[INSERT], 758, 2
[INSERT], 759, 0
[INSERT], 760, 0
[INSERT], 761, 1
[INSERT], 762, 1
[INSERT], 763, 0
[INSERT], 764, 2
[INSERT], 765, 1
[INSERT], 766, 1
[INSERT], 767, 0
[INSERT], 768, 0
[INSERT], 769, 1
[INSERT], 770, 1
[INSERT], 771, 0
[INSERT], 772, 0
[INSERT], 773, 0
[INSERT], 774, 0
[INSERT], 775, 0
[INSERT], 776, 1
[INSERT], 777, 0
[INSERT], 778, 0
[INSERT], 779, 0
[INSERT], 780, 0
[INSERT], 781, 0
[INSERT], 782, 0
[INSERT], 783, 0
[INSERT], 784, 0
[INSERT], 785, 1
[INSERT], 786, 1
[INSERT], 787, 0
[INSERT], 788, 1
[INSERT], 789, 0
[INSERT], 790, 0
[INSERT], 791, 0
[INSERT], 792, 0
[INSERT], 793, 0
[INSERT], 794, 2
[INSERT], 795, 2
[INSERT], 796, 0
[INSERT], 797, 0
[INSERT], 798, 0
[INSERT], 799, 0
[INSERT], 800, 0
[INSERT], 801, 0
[INSERT], 802, 0
[INSERT], 803, 0
[INSERT], 804, 1
[INSERT], 805, 0
[INSERT], 806, 0
[INSERT], 807, 0
[INSERT], 808, 0
[INSERT], 809, 0
[INSERT], 810, 0
[INSERT], 811, 1
[INSERT], 812, 1
[INSERT], 813, 0
[INSERT], 814, 0
[INSERT], 815, 0
[INSERT], 816, 1
[INSERT], 817, 1
[INSERT], 818, 1
[INSERT], 819, 0
[INSERT], 820, 2
[INSERT], 821, 0
[INSERT], 822, 1
[INSERT], 823, 0
[INSERT], 824, 0
[INSERT], 825, 1
[INSERT], 826, 0
[INSERT], 827, 0
[INSERT], 828, 0
[INSERT], 829, 0
[INSERT], 830, 1
[INSERT], 831, 0
[INSERT], 832, 1
[INSERT], 833, 0
[INSERT], 834, 0
[INSERT], 835, 0
[INSERT], 836, 0
[INSERT], 837, 1
[INSERT], 838, 1
[INSERT], 839, 0
[INSERT], 840, 0
[INSERT], 841, 0
[INSERT], 842, 2
[INSERT], 843, 0
[INSERT], 844, 2
[INSERT], 845, 0
[INSERT], 846, 0
[INSERT], 847, 1
[INSERT], 848, 0
[INSERT], 849, 1
[INSERT], 850, 1
[INSERT], 851, 0
[INSERT], 852, 5
[INSERT], 853, 2
[INSERT], 854, 1
[INSERT], 855, 0
[INSERT], 856, 1
[INSERT], 857, 0
[INSERT], 858, 1
[INSERT], 859, 0
[INSERT], 860, 0
[INSERT], 861, 2
[INSERT], 862, 4
[INSERT], 863, 1
[INSERT], 864, 2
[INSERT], 865, 2
[INSERT], 866, 0
[INSERT], 867, 3
[INSERT], 868, 1
[INSERT], 869, 3
[INSERT], 870, 3
[INSERT], 871, 1
[INSERT], 872, 2
[INSERT], 873, 1
[INSERT], 874, 2
[INSERT], 875, 1
[INSERT], 876, 0
[INSERT], 877, 3
[INSERT], 878, 3
[INSERT], 879, 1
[INSERT], 880, 1
[INSERT], 881, 1
[INSERT], 882, 0
[INSERT], 883, 1
[INSERT], 884, 0
[INSERT], 885, 0
[INSERT], 886, 2
[INSERT], 887, 0
[INSERT], 888, 1
[INSERT], 889, 0
[INSERT], 890, 3
[INSERT], 891, 1
[INSERT], 892, 2
[INSERT], 893, 2
[INSERT], 894, 4
[INSERT], 895, 0
[INSERT], 896, 0
[INSERT], 897, 1
[INSERT], 898, 2
[INSERT], 899, 2
[INSERT], 900, 0
[INSERT], 901, 1
[INSERT], 902, 0
[INSERT], 903, 3
[INSERT], 904, 2
[INSERT], 905, 0
[INSERT], 906, 2
[INSERT], 907, 0
[INSERT], 908, 1
[INSERT], 909, 0
[INSERT], 910, 1
[INSERT], 911, 2
[INSERT], 912, 3
[INSERT], 913, 0
[INSERT], 914, 2
[INSERT], 915, 0
[INSERT], 916, 2
[INSERT], 917, 5
[INSERT], 918, 0
[INSERT], 919, 1
[INSERT], 920, 0
[INSERT], 921, 1
[INSERT], 922, 2
[INSERT], 923, 0
[INSERT], 924, 2
[INSERT], 925, 0
[INSERT], 926, 0
[INSERT], 927, 0
[INSERT], 928, 0
[INSERT], 929, 2
[INSERT], 930, 0
[INSERT], 931, 0
[INSERT], 932, 0
[INSERT], 933, 1
[INSERT], 934, 0
[INSERT], 935, 0
[INSERT], 936, 0
[INSERT], 937, 0
[INSERT], 938, 0
[INSERT], 939, 1
[INSERT], 940, 0
[INSERT], 941, 1
[INSERT], 942, 2
[INSERT], 943, 1
[INSERT], 944, 1
[INSERT], 945, 2
[INSERT], 946, 2
[INSERT], 947, 2
[INSERT], 948, 1
[INSERT], 949, 0
[INSERT], 950, 1
[INSERT], 951, 1
[INSERT], 952, 0
[INSERT], 953, 1
[INSERT], 954, 1
[INSERT], 955, 0
[INSERT], 956, 0
[INSERT], 957, 1
[INSERT], 958, 0
[INSERT], 959, 1
[INSERT], 960, 0
[INSERT], 961, 1
[INSERT], 962, 2
[INSERT], 963, 0
[INSERT], 964, 2
[INSERT], 965, 3
[INSERT], 966, 1
[INSERT], 967, 0
[INSERT], 968, 1
[INSERT], 969, 0
[INSERT], 970, 1
[INSERT], 971, 1
[INSERT], 972, 0
[INSERT], 973, 0
[INSERT], 974, 0
[INSERT], 975, 0
[INSERT], 976, 0
[INSERT], 977, 1
[INSERT], 978, 0
[INSERT], 979, 0
[INSERT], 980, 0
[INSERT], 981, 0
[INSERT], 982, 0
[INSERT], 983, 0
[INSERT], 984, 0
[INSERT], 985, 0
[INSERT], 986, 0
[INSERT], 987, 0
[INSERT], 988, 0
[INSERT], 989, 0
[INSERT], 990, 0
[INSERT], 991, 0
[INSERT], 992, 0
[INSERT], 993, 0
[INSERT], 994, 0
[INSERT], 995, 0
[INSERT], 996, 0
[INSERT], 997, 0
[INSERT], 998, 0
[INSERT], 999, 1
[INSERT], >1000, 941
java -cp /home/michim/gitdev/YCSB/core/target/core-0.1.4.jar:/home/michim/gitdev/YCSB/infinispan/src/main/conf:/home/michim/gitdev/YCSB/hbase/src/main/conf:/home/michim/gitdev/YCSB/jdbc/src/main/conf:/home/michim/gitdev/YCSB/nosqldb/src/main/conf:/home/michim/gitdev/YCSB/mapkeeper/target/mapkeeper-binding-0.1.4.jar:/home/michim/gitdev/YCSB/mapkeeper/target/archive-tmp/mapkeeper-binding-0.1.4.jar:/home/michim/gitdev/YCSB/gemfire/src/main/conf:/home/michim/gitdev/YCSB/voldemort/src/main/conf com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.MapKeeperClient -P workloads/workloada -p mapkeeper.host=dqa-config2-006.dht.bf1.yahoo.com -p mapkeeper.port=9090 -s -threads 7000 -load